app/Controllers/Home.php

    public function index()
    {

        $pages  = 'undifined';
        $data['wakopaji'] = null;
        if($this->currentUser['system_role']=="mkusanyaji" || $this->currentUser['system_role']=="mapokezi"){
            $model = new ClientsModel();
            $data['wakopaji']= $model->where('microfinace_id',$this->currentMicrofinance['id'])->orderBy('full_name','ASC')->findAll();
---
SELECT *
FROM `clients`
WHERE `microfinace_id` = '1'
ORDER BY `full_name` ASC