app/Controllers/MikopoController.php

    public function tazamaMkopo($id)
    {
        $id = $id;
        $acl = new AclContoller;
        $acl->ruhusu('mhasibu');
        $acl->ruhusu('meneja');
        $acl->ruhusu('mapokezi');
        $acl->ruhusu('mkusanyaji');
        $acl->ruhusu('afisa_mkopo');
        $acl->kwenyepage($this->currentpage . 'orodha');
        $acl->addPerm('add');
        if ($acl->amerusiwa($this->currentUser['system_role'], $this->currentpage . 'orodha', 'add')) {
            $mokoId =  $this->shared->simpleDecrypt(base64_decode($id));
                $mokoId = $this->shared->cleanVar($mokoId);
            if (is_numeric($mokoId)) {
                $taarifaZamkopo = $this->model->where('id', $mokoId, true)->first();
                $mokopajid = $taarifaZamkopo['client_id'];
                //user data
                $model = new Guarantor();
                $wadhamin = $model->getSponsersByUser($mokopajid, $this->currentMicrofinance['id']);
                $model = new MikopoModel();
                $mikopo_liyopitilzaMuda = $model->getOverDueLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $mikopo_haijaLipwa_atakidogo = $model->getHajiaguswaLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $madeniyote = $model->getAllLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $hajamalizika = $model->getincompletengLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $model = new ClientsModel();
                $mokopajiInfo = $model->where('id', $mokopajid, true)->first();
---
SELECT *
FROM `loans`
WHERE `id` = '4'
 LIMIT 1
SELECT *
FROM `clients`
WHERE `id` = '4'
 LIMIT 1

    public function ratibaYaMalipo($id)
    {
        $id = $id;
        $acl = new AclContoller;
        $acl->ruhusu('mhasibu');
        $acl->ruhusu('meneja');
        $acl->ruhusu('mapokezi');
        $acl->ruhusu('mkusanyaji');
        $acl->ruhusu('afisa_mkopo');
        $acl->kwenyepage($this->currentpage . 'orodha');
        $acl->addPerm('add');
        if ($acl->amerusiwa($this->currentUser['system_role'], $this->currentpage . 'orodha', 'add')) {
            $mokoId =  $this->shared->simpleDecrypt(base64_decode($id));
                $mokoId = $this->shared->cleanVar($mokoId);
            if (is_numeric($mokoId)) {
                $taarifaZamkopo = $this->model->where('id', $mokoId, true)->first();
                $mokopajid = $taarifaZamkopo['client_id'];
                //user data
                $model = new Guarantor();
                $wadhamin = $model->getSponsersByUser($mokopajid, $this->currentMicrofinance['id']);
                $model = new MikopoModel();
                $mikopo_liyopitilzaMuda = $model->getOverDueLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $mikopo_haijaLipwa_atakidogo = $model->getHajiaguswaLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $madeniyote = $model->getAllLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $hajamalizika = $model->getincompletengLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                $model = new ClientsModel();
                $mokopajiInfo = $model->where('id', $mokopajid, true)->first();
---
SELECT *
FROM `loans`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `clients`
WHERE `id` = '3'
 LIMIT 1

                    $madeniyote = $model->getAllLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                    $hajamalizika = $model->getincompletengLoansbyUser($mokopajid, $this->currentMicrofinance['id']);
                    $model = new ClientsModel();
                    $mokopajiInfo = $model->where('id', $mokopajid, true)->first();
---
SELECT *
FROM `loans`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `clients`
WHERE `id` = '3'
 LIMIT 1